tomcatty/BluetrackHub/nRF5SDK160098a08e2/components/libraries/bootloader/ble_dfu/nrf_dfu_ble.c
NRF_BALLOC_DEF(m_buffer_pool, MAX_DFU_PKT_LEN, MAX_DFU_BUFFERS);


/**@brief     Function for the Advertising functionality initialization.
 *
 * @details   Encodes the required advertising data and passes it to the stack.
 *            The advertising data encoded here is specific for DFU.
 */
static uint32_t advertising_init(uint8_t adv_flags, ble_gap_adv_params_t const * const p_adv_params)
{
    uint32_t err_code;
    uint16_t actual_device_name_length = BLE_GAP_ADV_SET_DATA_SIZE_MAX - APP_ADV_DATA_HEADER_SIZE;

    /* This needs to be static because of SoftDevice API requirements. */
    static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
#ifdef BLUETRACK
    static uint8_t m_enc_scan_rsp_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
#endif

    ble_gap_adv_data_t m_adv_data =
    {
        .adv_data =
        {
            .p_data = m_enc_advdata,
            .len    = APP_ADV_DATA_HEADER_SIZE,
#ifdef BLUETRACK
        },
        .scan_rsp_data =
        {
             .p_data = m_enc_scan_rsp_data,
             .len    = 18UL,
        }
#else
        }
#endif
    };

    /* Encode flags. */
    m_enc_advdata[0] = 0x2;
    m_enc_advdata[1] = BLE_GAP_AD_TYPE_FLAGS;
    m_enc_advdata[2] = adv_flags;

    /* Encode 'more available' UUID list. */
    m_enc_advdata[3] = 0x3;
    m_enc_advdata[4] = BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE;
    m_enc_advdata[5] = LSB_16(BLE_DFU_SERVICE_UUID);
    m_enc_advdata[6] = MSB_16(BLE_DFU_SERVICE_UUID);

    /* Get GAP device name and length. */
    err_code = sd_ble_gap_device_name_get(&m_enc_advdata[9], &actual_device_name_length);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Set GAP device in advertising data.
    m_enc_advdata[7] = actual_device_name_length + 1; // (actual_length + ADV_AD_TYPE_FIELD_SIZE(1))
    m_enc_advdata[8] = BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME;

    m_adv_data.adv_data.len += actual_device_name_length;
#ifdef BLUETRACK
    // Encode manufacturer data in scan reponse
    m_enc_scan_rsp_data[0] = 17UL;
    m_enc_scan_rsp_data[1] = BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
    m_enc_scan_rsp_data[2] = 0x43;
    m_enc_scan_rsp_data[3] = 0x03;
    m_enc_scan_rsp_data[4] = (uint8_t) ((NRF_UICR->CUSTOMER[0] & 0x000000FF) >> 0);
    m_enc_scan_rsp_data[5] = (uint8_t) ((NRF_UICR->CUSTOMER[0] & 0x0000FF00) >> 8);
    m_enc_scan_rsp_data[6] = (uint8_t) ((NRF_UICR->CUSTOMER[0] & 0x00FF0000) >> 16);
    m_enc_scan_rsp_data[7] = (uint8_t) ((NRF_UICR->CUSTOMER[0] & 0xFF000000) >> 24);
    m_enc_scan_rsp_data[8] = (uint8_t) ((SD_OFFSET_GET_UINT16(MBR_SIZE,0x0C) & 0x00FF) >> 0);
    m_enc_scan_rsp_data[9] = (uint8_t) ((SD_OFFSET_GET_UINT16(MBR_SIZE,0x0C) & 0xFF00) >> 8);
    m_enc_scan_rsp_data[10] = (uint8_t) ((s_dfu_settings.bootloader_version & 0x000000FF) >> 0);
    m_enc_scan_rsp_data[11] = (uint8_t) ((s_dfu_settings.bootloader_version & 0x0000FF00) >> 8);
    m_enc_scan_rsp_data[12] = (uint8_t) ((s_dfu_settings.bootloader_version & 0x00FF0000) >> 16);
    m_enc_scan_rsp_data[13] = (uint8_t) ((s_dfu_settings.bootloader_version & 0xFF000000) >> 24);
    m_enc_scan_rsp_data[14] = (uint8_t) ((s_dfu_settings.app_version & 0x000000FF) >> 0);
    m_enc_scan_rsp_data[15] = (uint8_t) ((s_dfu_settings.app_version & 0x0000FF00) >> 8);
    m_enc_scan_rsp_data[16] = (uint8_t) ((s_dfu_settings.app_version & 0x00FF0000) >> 16);
    m_enc_scan_rsp_data[17] = (uint8_t) ((s_dfu_settings.app_version & 0xFF000000) >> 24);
#endif

    return sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, p_adv_params);
}


/**@brief Function for starting advertising.
 */
static uint32_t advertising_start(void)
{
    uint32_t err_code;
    uint8_t  adv_flag = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    ble_gap_adv_params_t adv_params =
    {
        .properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED,
        .p_peer_addr     = NULL,
        .filter_policy   = BLE_GAP_ADV_FP_ANY,
        .interval        = NRF_DFU_BLE_ADV_INTERVAL,
        .duration        = APP_ADV_DURATION,
        .primary_phy     = BLE_GAP_PHY_1MBPS,
    };

    NRF_LOG_DEBUG("Advertising...");

#if (NRF_DFU_BLE_REQUIRES_BONDS)
    ble_gap_irk_t empty_irk = {{0}};

    if (memcmp(m_peer_data.ble_id.id_info.irk, empty_irk.irk, sizeof(ble_gap_irk_t)) != 0)
    {
        adv_flag                 = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
        adv_params.filter_policy = BLE_GAP_ADV_FP_FILTER_CONNREQ;

        ble_gap_addr_t   const * const p_gap_addr   = &m_peer_data.ble_id.id_addr_info;
        ble_gap_id_key_t const * const p_gap_id_key = &m_peer_data.ble_id;

        err_code = sd_ble_gap_whitelist_set(&p_gap_addr, 1);
        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_WARNING("sd_ble_gap_whitelist_set() returned %s",
                            NRF_LOG_ERROR_STRING_GET(err_code));
        }

        err_code = sd_ble_gap_device_identities_set(&p_gap_id_key, NULL, 1);
        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_WARNING("sd_ble_gap_device_identities_set() returned %s",
                            NRF_LOG_ERROR_STRING_GET(err_code));
        }
    }
#endif /* NRF_DFU_BLE_REQUIRES_BONDS */

    err_code = advertising_init(adv_flag, &adv_params);
    VERIFY_SUCCESS(err_code);

    err_code = sd_ble_gap_adv_stop(m_adv_handle);
    UNUSED_RETURN_VALUE(err_code);

    return sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
}


static bool is_cccd_configured(ble_dfu_t * p_dfu)
{
    uint8_t cccd_val_buf[BLE_CCCD_VALUE_LEN];

    ble_gatts_value_t gatts_value =
    {
        .len     = BLE_CCCD_VALUE_LEN,
        .p_value = cccd_val_buf
    };

    /* Check the CCCD Value of DFU Control Point. */
    uint32_t err_code = sd_ble_gatts_value_get(m_conn_handle,
                                               p_dfu->dfu_ctrl_pt_handles.cccd_handle,
                                               &gatts_value);
    VERIFY_SUCCESS(err_code);

    return ble_srv_is_notification_enabled(cccd_val_buf);
}


static ret_code_t response_send(uint8_t * p_buf, uint16_t len)
{
    ble_gatts_hvx_params_t hvx_params =
    {
        .handle = m_dfu.dfu_ctrl_pt_handles.value_handle,
        .type   = BLE_GATT_HVX_NOTIFICATION,
        .p_data = (uint8_t *)(p_buf),
        .p_len  = &len,
    };

